# Пользователь вводит 3 числа, сказать сколько из них положительных и сколько отрицательных
a, b, c = 5, -8, -9
print(a >= 0, b >= 0, c >= 0)
print(True + False + False)