# Вывести четные числа от 2 до N по 5 в строку
from collections import Counter

N: int = int(input("Введите число: "))
x = []

for i in range(2, N, 2):
    x.append(i)
    if Counter:
        print(x)





























