# Вывести четные числа от 2 до N по 5 в строку

N: int = int(input("Введите число: "))
x = []

for i in range(2, N, 2):
    x.append(i)
print(x)


























